Kontakty/app/controllers/contacts_controller.rb

SELECT * FROM "contacts"
---
  def index
    @contacts = Contact.all

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def show
    @contact = Contact.find(params[:id])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def edit
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("imie", "nazwisko", "updated_at", "tel", "email", "created_at") VALUES('sdgf', 'sdfs', '2009-11-21 08:58:33', 'sdfsd', 'manfred19@o2.pl', '2009-11-21 08:58:33')
---
  def create
    @contact = Contact.new(params[:contact])
    respond_to do |format|
      if @contact.save

SELECT * FROM "contacts" WHERE ("contacts"."id" = 11)
UPDATE "contacts" SET "email" = 'greg@nokes.name', "updated_at" = '2009-11-21 13:50:09' WHERE "id" = 11
---
  def update
    @contact = Contact.find(params[:id])


    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT * FROM "contacts" WHERE ("contacts"."id" = 3)
DELETE FROM "contacts" WHERE "id" = 3
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy